Revit 2016 API
BoundarySegment.Document Property
Provides the document in which the element that created this segment resides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2016.")]
public Document Document { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016.")> _
Public ReadOnly Property Document As Document
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016.")]
public:
property Document^ Document {
	Document^ get ();
}
See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace